{
  "home": "الرئيسية",
  "about_me": "من انا",
  "about_desc":"مطوّر واجهات أمامية شغوف بتحويل الأفكار إلى تجارب ويب تفاعلية وسلسة. أمزج بين التصميم الجذاب والبرمجة النظيفة لإنشاء واجهات استخدام سهلة وبديهية. يدفعني شغفي بالبرمجة إلى تقديم تجارب رقمية ديناميكية ومميزة توازن بين الأداء العملي والجاذبية البصرية.",
  "projects": "مشاريعي",
  "download_cv": "السيرة الذاتية",
  "hi_i_am": "مرحبا انا",
  "khaled_ali": "خالد الشيخ علي",
  "frontend": "مطور ويب",
  "web_developer": "مطور ويب",
  "intro_desc": "مطور ويب طموح، لدي خبرة تزيد عن عامين في بناء تطبيقات ويب قوية وقابلة للتوسع. أتخصص في تحويل الأفكار المعقدة إلى حلول رقمية سلسة وعالية الأداء.",
  "contact_me": "تواصل معي",
  "education": "التعليم",
  "computer_engineer": "مهندس حاسوب",
  "years": "{count} سنوات",
  "completed": "{count} مكتمل",
  "opportunities": "فرص العمل",
  "open_to_work": "متاح للعمل حاليا",
  "advanced": "متقدم",
  "intermediate": "متوسط",
  "basic":"أساسي",
  "skills": "المهارات",
  "rights_reserved": "جميع الحقوق محفوظة",
  "experience": "الخبرات",
  "trillium_soft": "تريلويم سوفت",
  "web_dev": "مطور ويب",
  "freelancer": "فريلانسر",
  "palestine": "فلسطين ",
  "gaza": "غزة",
  "online": "اونلاين",
  "name": "الاسم",
  "email": "البريد الالكتروني",
  "send": "ارسال",
  "message": "رسالتك",
  "projects_items": {
    "e_learning": {
      "title": "منصة التعلم الالكتروني",
      "desc":"قمت بتطوير وإطلاق منصة تعليم إلكتروني شاملة تقدم مجموعة واسعة من الدورات التعليمية عبر الإنترنت. صممت واجهة مستخدم سهلة الاستخدام لتعزيز تفاعل المتعلمين، وساهمت في توفير تجربة تعليمية تفاعلية، وتعاونت بشكل وثيق مع المحاضرين لضمان تقديم محتوى عالي الجودة. كما حرصت على تحقيق تصميم متجاوب ووظائف سلسة على جميع الأجهزة لضمان تجربة استخدام متكاملة وسهلة الوصول"
    },
    "aptu": {
      "title": "منصة APTU المتعددة الواجهات",
      "desc":"Aptu هو موقع إلكتروني متطور متعدد الواجهات، مصمم لتقديم تجربة مستخدم سلسة وجذابة. يتضمن أقسامًا منظمة بعناية مثل الصفحة الرئيسية، من نحن، الميزات، الاشتراكات، والدعم، جميعها مصممة بمنهجية تركز على احتياجات المستخدم. ومن خلال التنقل السهل، والوظائف المتكاملة، والتصميم المتجاوب بالكامل، يقدم Aptu حلاً رقميًا شاملاً يتيح للمستخدمين التفاعل مع النظام بكل سهولة وكفاءة."
    },
    "alfajri": {
      "title": "متجر الفجر",
      "desc":"قمت بتحديث نظام تسجيل الدخول والتسجيل مع واجهة المستخدم الخاصة به لتحسين الأداء وتجربة المستخدم. كما أعدت تصميم واجهات المستخدم في عدة صفحات، وأضفت شرائح تفاعلية (Swiper) لتعزيز الجاذبية البصرية والتفاعل، مما ساهم في تقديم تجربة استخدام أكثر سلاسة وفاعلية."
    },
    "qanuni": {
      "title": "موقع القانوني",
      "desc":"يضم الموقع عدة أقسام متكاملة، من بينها قسم لنشر المقالات، ومنتدى للنقاش بين المستخدمين، بالإضافة إلى قسم مخصص لتبادل الملفات ومشاركتها بين الأعضاء. كما يحتوي على قسم للاختبارات يتيح للمستخدمين إجراء الامتحانات وعرض نتائجهم. ويُوفر الموقع أيضًا نظام دردشة مدمج يتيح التواصل الفوري بين المستخدمين، مما يعزز من التفاعل والتعاون فيما بينهم."
    },
    "freelancer": {
      "title": "العمل الحر",
      "desc":"كعامل حر، شاركت في مجموعة متنوعة من مشاريع الويب، بما في ذلك منصات الأخبار والمتاجر الإلكترونية. شمل عملي دمج أنظمة الدفع الآمنة، وتحسين المواقع من حيث الاستجابة لمحركات البحث والأجهزة المختلفة، بالإضافة إلى تحسين واجهات المستخدم لتقديم تجربة استخدام مميزة. كما أتمتع بخبرة قوية في تطوير واجهات برمجة التطبيقات (RESTful APIs)، ودمج الخدمات الخارجية، وإدارة قواعد البيانات العلائقية بكفاءة."
    }
  },
  "let_s_connect":"لنُنشئ شيئًا رائعًا معًا",
  "contact_description":"أنا منفتح حاليًا على فرص جديدة ومشاريع تعاونية. سواء كان لديك سؤال، أو مجرد فكرة لمشروع، أو تود فقط التواصل، لا تتردد في مراسلتي. سأكون سعيدًا بالتواصل معك في أقرب وقت ممكن."
}
