{
  "home": "الرئيسية",
  "about_me": "من أنا",
  "about_desc": "أنا مطور ويب شغوف بتحويل الأفكار إلى تجارب ويب سلسة وتفاعلية. أدمج التصميم الجمالي مع كود نظيف وفعّال لبناء واجهات سهلة الاستخدام وذات تجربة مستخدم ممتازة. أركز على الجمع بين الوظائف والمظهر لتقديم تجارب رقمية جذابة تترك انطباعًا قويًا.",
  "projects": "المشاريع",
  "download_cv": "تحميل السيرة الذاتية",
  "hi_i_am": "مرحبًا، أنا",
  "khaled_ali": "خالد شيخ علي",
  "frontend": "مطور واجهات أمامية",
  "web_developer": "مطور ويب",
  "intro_desc": "مطور ويب لديه أكثر من سنتين من الخبرة في بناء تطبيقات ويب قابلة للتطوير وعالية الأداء. أختص بتحويل الأفكار المعقدة إلى حلول رقمية سلسة وفعّالة تلبّي احتياجات المستخدمين والأعمال.",
  "contact_me": "تواصل معي",
  "education": "التعليم",
  "computer_engineer": "مهندس حاسوب",
  "years": "{count} سنوات",
  "completed": "{count} مكتمل",
  "opportunities": "فرص",
  "open_to_work": "متاح للعمل",
  "advanced": "متقدم",
  "intermediate": "متوسط",
  "basic": "أساسي",
  "skills": "المهارات",
  "rights_reserved": "جميع الحقوق محفوظة",
  "experience": "الخبرة",
  "trillium_soft": "Trillium Soft",
  "web_dev": "مطور ويب",
  "freelancer": "مستقل",
  "palestine": "فلسطين",
  "gaza": "غزة",
  "online": "متصل",
  "subject":"الموضوع",
  "name": "الاسم",
  "email": "البريد الإلكتروني",
  "send": "إرسال",
  "message": "الرسالة",
  "demo": "عرض مباشر",
  "projects_items": {
    "e_learning": {
      "title": "منصة تعليمية إلكترونية",
      "desc": "قمت بتطوير منصة تعليمية شاملة توفر مجموعة واسعة من الدورات عبر الإنترنت. صممت واجهة سهلة الاستخدام لتعزيز التفاعل، وتسهيل تجربة التعلم التفاعلي، وضمان جودة المحتوى بالتعاون مع المدربين. ركزت على تصميم متجاوب وأداء سلس عبر جميع الأجهزة."
    },
    "aptu": {
      "title": "موقع APTU",
      "desc": "تم إنشاء منصة ويب متعددة الواجهات مع أقسام منظمة مثل الرئيسية، من نحن، المميزات، الاشتراكات والدعم. تم التركيز على سهولة التصفح، الأداء السلس، والتصميم المتجاوب لتقديم تجربة مستخدم مريحة وجذابة."
    },
    "alfajri": {
      "title": "متجر الفجري الإلكتروني",
      "desc": "تم إعادة تصميم نظام تسجيل الدخول والتسجيل لتحسين تجربة المستخدم، وإعادة تصميم الصفحات الرئيسية بواجهة حديثة، وتعزيز التفاعل باستخدام عناصر سلايدر Swiper لتجربة تسوق أكثر جذبًا."
    },
    "anhargo": {
      "title": "متجر أنهاراجرو الإلكتروني",
      "desc": "تم تحسين تجربة المستخدم في صفحات التسجيل والواجهة الأساسية، وإعادة تصميم الواجهة بشكل عصري، ودمج سلايدر Swiper لتعزيز التفاعل والمظهر الجذاب."
    },
    "stc": {
      "title": "نظام شهادات تدريب وموقع STC",
      "desc": "تم بناء نظام متكامل لإصدار شهادات تدريب إلكترونية مع التحقق عبر QR وإدارة سهلة من خلال لوحة تحكم. كما تم تطوير موقع الشركة المتجاوب لعرض الخدمات والأخبار بشكل فعال."
    },
    "qanuni": {
      "title": "موقع القانوني",
      "desc": "تم تطوير منصة متعددة الوظائف تشمل نشر المقالات، منتديات النقاش، مشاركة الملفات، ووحدات الاختبارات عبر الإنترنت. كما تم دمج نظام دردشة فوري لتسهيل التواصل والتعاون بين المستخدمين."
    },
    "freelancer": {
      "title": "مشاريع العمل الحر",
      "desc": "عملت على مجموعة متنوعة من مشاريع الويب بما في ذلك منصات الأخبار والمتاجر الإلكترونية. قمت بدمج أنظمة دفع آمنة، تحسين الأداء وتجربة المستخدم، تطوير واجهات برمجية RESTful وإدارة قواعد البيانات بشكل فعال."
    }
  },
  "let_s_connect": "لنصنع شيئًا رائعًا معًا",
  "contact_description": "أنا متاح لفرص جديدة وتعاونات. سواء كان لديك سؤال، فكرة مشروع، أو ترغب فقط في التحية، لا تتردد في التواصل. سأحرص على الرد سريعًا ومساعدتك في تحويل أفكارك إلى واقع."
}
