{
  "home": "Home",
  "about_me": "About Me",
  "about_desc": "I'm a Web developer passionate about transforming ideas into smooth, interactive web experiences. I combine aesthetic design with clean, efficient code to create intuitive and user-friendly interfaces. With a focus on both functionality and visual appeal, I build engaging digital experiences that leave a lasting impression.",
  "projects": "Projects",
  "download_cv": "Download CV",
  "hi_i_am": "Hi, I am",
  "khaled_ali": "Khaled Sheikh Ali",
  "frontend": "Front-end Developer",
  "web_developer": "Web Developer",
  "intro_desc": "Motivated web developer with over two years of experience creating scalable, high-performance web applications. I specialize in turning complex ideas into seamless digital solutions that delight users and meet business goals.",
  "contact_me": "Contact Me",
  "education": "Education",
  "computer_engineer": "Computer Engineer",
  "years": "{count} years",
  "completed": "{count} completed",
  "opportunities": "Opportunities",
  "open_to_work": "Open to Work",
  "advanced": "Advanced",
  "intermediate": "Intermediate",
  "basic": "Basic",
  "skills": "Skills",
  "rights_reserved": "All rights reserved",
  "experience": "Experience",
  "trillium_soft": "Trillium Soft",
  "web_dev": "Web Developer",
  "freelancer": "Freelancer",
  "palestine": "Palestine",
  "gaza": "Gaza",
  "remote": "Remotely",
  "subject":"subject",
  "name": "Name",
  "email": "Email",
  "send": "Send",
  "message": "Message",
  "demo": "Live Demo",
  "projects_items": {
    "e_learning": {
      "title": "E-learning Platform",
      "desc": "Developed a comprehensive E-learning platform offering a wide variety of online courses. Designed an intuitive interface to boost learner engagement, facilitate interactive learning, and ensure content quality in collaboration with instructors. Prioritized responsive design and seamless performance across devices."
    },
    "aptu": {
      "title": "APTU Interfaces Website",
      "desc": "Created a sophisticated multi-interface web platform with well-structured sections like Home, About, Features, Subscriptions, and Support. Focused on intuitive navigation, seamless functionality, and responsive design, providing users a smooth and engaging experience."
    },
    "alfajri": {
      "title": "Alfajri Ecommerce",
      "desc": "Redesigned login and registration systems for better usability, revamped multiple pages with a modern UI, and enhanced interactivity using Swiper sliders for a more engaging e-commerce experience."
    },
    "anhargo": {
      "title": "Anhaar Agro Ecommerce",
      "desc": "Revamped the user onboarding and core pages for improved UX, redesigned the interface with a modern look, and integrated Swiper sliders to increase visual engagement and interactivity."
    },
    "stc": {
      "title": "Training Certificates System & STC Website",
      "desc": "Built a robust system for issuing electronic training certificates with QR verification and an admin panel for easy management. Developed a responsive company website to showcase services, news, and updates effectively."
    },
    "qanuni": {
      "title": "Al Qanuni Website",
      "desc": "Developed a multi-functional platform with article publishing, discussion forums, file sharing, and online exam modules. Integrated real-time chat for seamless user interaction and collaboration."
    },
    "freelancer": {
      "title": "Freelancer Projects",
      "desc": "Worked on diverse web projects including news portals and e-commerce stores. Integrated secure payment systems, optimized for SEO and responsiveness, refined UI/UX, and developed RESTful APIs while managing relational databases efficiently."
    }
  },
  "let_s_connect": "Let's Build Something Amazing Together",
  "contact_description": "I'm open to new opportunities and collaborations. Whether you have a question, a project idea, or just want to say hello, feel free to reach out. I strive to respond promptly and help bring your ideas to life.",
  "show_more":"show more results"
}
